Wk19/intro_app_api/app/controllers/api/users_controller.rb

    def create
      user = User.create(user_params)
---
INSERT INTO "users" ("title", "password_digest") VALUES ($1, $2) RETURNING "id"  [["title", "Ashish"], ["password_digest", "$2a$12$QQnK5mVUw.HqC/Yg6TeKBOuvVj0rY9QuxgQZ0NZl/QIxepf.Bu.GO"]]