RAILS/intro_app_api/app/controllers/api/auth_controller.rb

  def login
    user = User.find_by(title: params[:title])
---
SELECT "users".* FROM "users" WHERE "users"."title" = $1 LIMIT $2  [["title", "Test2"], ["LIMIT", 1]]