RAILS/intro_app_api/app/controllers/api/todos_controller.rb

      def create
        todo = Todo.create(title: params[:title], description: params[:description], completed: params[:completed])
---
INSERT INTO "todos" ("title", "completed", "description") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Leo"], ["completed", true], ["description", "Cat"]]

      def show
        render json: Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

      def update
       todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]