RAILS/intro_app_api/app/controllers/todos_controller.rb

    def index
        render json: Todo.all
---
SELECT "todos".* FROM "todos"

      def create
        todo = Todo.create(title: params[:title], description: params[:description], completed: params[:completed])
---
INSERT INTO "todos" ("title", "completed", "description") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Elena"], ["completed", true], ["description", "grand daughter"]]

      def show
        render json: Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

      def update
       todo = Todo.find(params[:id])
       todo.update(title: params[:title], description: params[:description], completed: params[:completed])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "completed" = $2, "description" = $3 WHERE "todos"."id" = $4  [["title", nil], ["completed", nil], ["description", "actor"], ["id", 3]]

      def destroy
        Todo.destroy(params[:id])
---
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 6]]